In [7]:
# Membalik urutan baris dan kolom pada Data Frame

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

In [2]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  8  4  6  7  4
1  6  4  4  1  6
2  4  6  3  7  2
3  8  4  7  2  5
4  7  9  8  3  8

In [3]:
df.loc[:, ::-1]

   E  D  C  B  A
0  4  7  6  4  8
1  6  1  4  4  6
2  2  7  3  6  4
3  5  2  7  4  8
4  8  3  8  9  7

In [4]:
df.loc[::-1]

   A  B  C  D  E
4  7  9  8  3  8
3  8  4  7  2  5
2  4  6  3  7  2
1  6  4  4  1  6
0  8  4  6  7  4

In [5]:
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  7  9  8  3  8
1  8  4  7  2  5
2  4  6  3  7  2
3  6  4  4  1  6
4  8  4  6  7  4

In [6]:
# Mengganti nama (label) kolom pada Data Frame

In [9]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  3  1  5  2  5
1  3  8  7  8  8
2  9  2  8  5  3
3  2  3  6  5  5
4  5  4  4  1  3

In [10]:
df.rename(columns={'C':'Hobi'})

   A  B  Hobi  D  E
0  3  1     5  2  5
1  3  8     7  8  8
2  9  2     8  5  3
3  2  3     6  5  5
4  5  4     4  1  3

In [11]:
df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'})

   Nama  Alamat  C  Kota  E
0     3       1  5     2  5
1     3       8  7     8  8
2     9       2  8     5  3
3     2       3  6     5  5
4     5       4  4     1  3

In [12]:
# Menghapus (drop) missing values (NaN)

In [13]:
n_rows = 30
n_cols = 4
cols = ['A', 'B', 'C', 'D']

df = pd.DataFrame(np.random.randn(n_rows, n_cols), columns=cols)

nan_mask = np.random.rand(n_rows, n_cols) < 0.2
df[nan_mask] = np.nan

df = df.reset_index()
df.head()

   index         A         B         C         D
0      0  1.331959  2.139646       NaN -0.482418
1      1 -0.316943 -0.005008  0.357132 -1.051513
2      2  2.236421  0.921714  0.163278  0.007177
3      3 -1.024827       NaN  0.234285  0.293872
4      4 -0.110135       NaN       NaN  0.718260

In [14]:
df = df.rename(columns={'index':'Z'})
df.head()

   Z         A         B         C         D
0  0  1.331959  2.139646       NaN -0.482418
1  1 -0.316943 -0.005008  0.357132 -1.051513
2  2  2.236421  0.921714  0.163278  0.007177
3  3 -1.024827       NaN  0.234285  0.293872
4  4 -0.110135       NaN       NaN  0.718260

In [15]:
df_backup = df.copy(deep=True)

In [16]:
df = df.dropna(axis='columns') 
df.head()

   Z
0  0
1  1
2  2
3  3
4  4

In [17]:
df = df_backup.copy(deep=True)
df = df.dropna(axis='rows')
df.head()

     Z         A         B         C         D
1    1 -0.316943 -0.005008  0.357132 -1.051513
2    2  2.236421  0.921714  0.163278  0.007177
7    7  0.422529 -0.205346  0.068887 -0.184150
8    8  1.487016 -0.529367  0.919296  0.740228
19  19 -1.161713 -0.557682  0.061418 -1.555162

In [18]:
df = df_backup.copy(deep=True)
df.isna().mean()

Z    0.000000
A    0.200000
B    0.233333
C    0.233333
D    0.133333
dtype: float64

In [19]:
treshold = len(df) * 0.9
df = df.dropna(thresh=treshold, axis='columns')
df.head()

   Z
0  0
1  1
2  2
3  3
4  4

In [20]:
# Memeriksa kesamaan antar dua buah kolom (Series) pada Data Frame

In [21]:
data = {'A':[15, 15, 18, np.nan, 12], 
        'B':[15, 15, 18, np.nan, 12]}

df = pd.DataFrame(data)
df

      A     B
0  15.0  15.0
1  15.0  15.0
2  18.0  18.0
3   NaN   NaN
4  12.0  12.0

In [22]:
df['A']

0    15.0
1    15.0
2    18.0
3     NaN
4    12.0
Name: A, dtype: float64

In [23]:
type(df['A'])

pandas.core.series.Series

In [24]:
type(df)

pandas.core.frame.DataFrame

In [25]:
df['A'] == df['B']

0     True
1     True
2     True
3    False
4     True
dtype: bool

In [26]:
df['A'].equals(df['B'])

True

In [27]:
df1 = df.copy(deep=True)

df.equals(df1)

True

In [28]:
df == df1

       A      B
0   True   True
1   True   True
2   True   True
3  False  False
4   True   True